#+title: Notas de Aula - 08 Modularização
#+author: Luigi D. C. Soares
#
#+startup: entitiespretty
#+options: toc:nil  num:nil
#
* Namespaces

Onde já vimos isso? ~std::~

E como podemos criar nossos próprios namespaces? Imagine que queremos criar um módulo de containers

seq.hpp (containers sequenciais)

#+begin_src C++ :main no :tangle seq.hpp
#ifndef CONTAINER_SEQ_H
#define CONTAINER_SEQ_H

namespace container {
template <typename T>
class Vector {
public:
  Vector();
  ~Vector();
  
  void push_back(T e);
  T at(std::size_t i) const;
  
private:
  std::size_t _size;
  std::size_t _capacity;
  T *_vector;
};

template <typename T>
class LinkedList {
  // ...
};
};

#include "vector.tpp"
#endif
#+end_src

vector.tpp (implementando o vector)

#+begin_src C++ :main no :tangle vector.tpp
namespace container {
template <typename T> Vector<T>::Vector() {
  _size = 0;
  _capacity = 8;
  _vector = new T[_capacity];
}

template <typename T> Vector<T>::~Vector() {
  delete[] _vector;
}

template <typename T> void Vector<T>::push_back(T e) {
  if (_size == _capacity) {
    _capacity *= 2;
    T *_new_vector = new T[_capacity];

    for (std::size_t i = 0; i < _size; i++) {
      _new_vector[i] = _vector[i];
    }

    delete[] _vector;
    _vector = _new_vector;
  }

  _vector[_size] = e;
  _size++;
}

template <typename T> T Vector<T>::at(std::size_t i) const {
  return _vector[i];
}
}
#+end_src

E agora vamos testar:

main.cpp

#+begin_src C++ :flags -std=c++17 -I.
#include <iostream>
#include "seq.hpp"

int main() {
  container::Vector<int> xs;
  
  for (unsigned i = 0; i < 10; i++) {
    xs.push_back(i);
  }

  std::cout << xs.at(8) << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 8

Podemos ter o mesmo namespace separado em múltiplos arquivos

assoc.hpp (containers associativos)

#+begin_src C++ :main no :tangle assoc.hpp
#ifndef CONTAINER_ASSOC_H
#define CONTAINER_ASSOC_H

namespace container {
template <typename T>
class Set {
  // ...
};

template <typename K, T>
class Map {
  // ...
};
}

#endif
#+end_src

